list = [1, 3, 5, 7, 3, 5, 2, 1]
print(set(list))
print(len(set(list)))

# проверка двух множеств на предмет включает ли одно из них другое в себя
a = {1, 3, 6, 2}
b = {6, 3, 2, 7, 1}
print(a.issubset(b))


a = {1, 3, 6, 2}
print(6 in a)

a = {1, 3, 6, 2}
b = {6, 3, 2, 7, 1}
print(b.issuperset(a))

#проверка что одно множество не содержит ни одного элемента другого множества
a = {1, 2, 3}
b = {4, 5, 6}
print(a.isdisjoint(b))

#объединить два множества
set1 = {1, 2, 3, 4, 5}
set2 = {3, 4, 6, 0, 5}
set3 = set1.union(set2)
print(set3)

#проверить какие элементы совпадают
set1 = {1, 2, 3, 4, 5}
set2 = {3, 4, 6, 0, 5}
print(set1.intersection(set2))

#проверить какие элементы множества 1 отсутствюут в множестве 2
set1 = {1, 2, 3, 4, 5, 9}
set2 = {3, 4, 6, 0, 5}
print(set1.difference(set2))

#проверить какие элементы отличаютс в обоих множествах
set1 = {1, 2, 3, 4, 5, 9}
set2 = {3, 4, 6, 0, 5}
print(set1.symmetric_difference(set2))

#добавляет(делает update) элементов из множества 2 в множество 1
set1 = {1, 2, 3, 4, 5, 9}
set2 = {3, 4, 6, 0, 5}
set1.update(set2)
print(set1)